In [6]:
import pandas as pd

df = pd.read_csv("titanic.csv")

df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [20]:
df["age"].notnull().value_counts() # Nombre de personnes ou l'age est présente et celle ou elle est nul

True     1046
False     263
Name: age, dtype: int64

In [24]:
df.groupby("survived").size() # Nombre de personnes qui ont survécu

survived
0    809
1    500
dtype: int64

In [35]:
df[df["survived"] == 1]["age"].mean() # Age moyen des survivant

28.918228103044495

In [36]:
df[df["survived"] == 1]["fare"].mean() # Prix moyen du ticket pour les survivants

49.361183600000004

In [37]:
df.groupby("survived")["age"].mean() # Comparatif de la moyen d'age entre les survivants et les morts

survived
0    30.545369
1    28.918228
Name: age, dtype: float64

In [53]:
df.groupby(["survived","sex"]).size() # Comparatif de nombre de femme/homme qui ont survécu

survived  sex
0         female    127
          male      682
1         female    339
          male      161
dtype: int64

In [54]:
df.groupby(["survived"])["sex", "age", "pclass"].count() # Nombre de personne qui ont survécu ou non par rapport à certain attribut

          sex  age  pclass
survived
0         809  619     809
1         500  427     500